"use client";

import React, { useState } from "react";
import ImagesSlider from "@/app/components/imageSlider";
import Image from "next/image";
import Pic from "@/public/assets/News/Gashnvare.jpg";

const banners = [
  {
    id: 1,
    title: "پیام تبریک به مناسبت ۷ خرداد، روز نقشه‌برداری",
    subTitle:
      "۷ خرداد، روز نقشه‌برداری، فرصتی ارزشمند برای پاسداشت جایگاه والای مهندسان نقشه‌بردار و نقش بنیادین آنان در توسعه، ایمنی، مدیریت شهری و تصمیم‌سازی‌های کلان کشور است.",
    titleClasses: "text-white text-center",
    subTitleClasses: "text-white text-center",
    iconClasses: "-translate-y-7 w-40",
    date: "1404/10/2 ",
  },
  {
    id: 2,
    title: "پیام تبریک به مناسبت ۷ خرداد، روز نقشه‌برداری",
    subTitle:
      "۷ خرداد، روز نقشه‌برداری، فرصتی ارزشمند برای پاسداشت جایگاه والای مهندسان نقشه‌بردار و نقش بنیادین آنان در توسعه، ایمنی، مدیریت شهری و تصمیم‌سازی‌های کلان کشور است.",
    titleClasses: "text-white text-center",
    subTitleClasses: "text-white text-center",
    iconClasses: "-translate-y-7 w-40",
    date: "1404/10/2 ",
  },
  {
    id: 3,
    title: "پیام تبریک به مناسبت ۷ خرداد، روز نقشه‌برداری",
    subTitle:
      "۷ خرداد، روز نقشه‌برداری، فرصتی ارزشمند برای پاسداشت جایگاه والای مهندسان نقشه‌بردار و نقش بنیادین آنان در توسعه، ایمنی، مدیریت شهری و تصمیم‌سازی‌های کلان کشور است.",
    titleClasses: "text-white text-center",
    subTitleClasses: "text-white text-center",
    iconClasses: "-translate-y-7 w-40",
    date: "1404/10/2 ",
  },
];

const newsCategory = [
  {
    id: 1,
    name: "اخبار",
    news: [
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
    ],
  },
  {
    id: 2,
    name: "اطلاعیه‌ها",
    news: [
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
    ],
  },
  {
    id: 3,
    name: "فراخوان",
    news: [
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
      {
        title: "نشست تخصصی فناوری‌های دیجیتال و هوش مصنوعی",
        content:
          "سازمان نظام مهندسی ساختمان استان تهران، در راستای توسعه فناوری‌های نوین، هوشمندسازی صنعت ساختمان و بهره‌گیری هدفمند از ظرفیت‌های هوش ",
      },
    ],
  },
];

export default function NewsPage() {
  const [selectedCategory, setSelectedCategory] = useState(1);

  return (
    <div className="p-5">
      <div className="flex flex-col p-3">
        <div className="flex items-start justify-center p-3 gap-8 bg-blue-100 rounded-t-2xl">
          <div className="bg-white rounded-2xl w-64 h-48 p-3">
            <Image src={Pic} alt="pic" className="h-full" />
          </div>
          <div className="max-w-4xl">
            <ImagesSlider banners={banners} autoPlay />
          </div>
        </div>
        <div className="bg-white flex flex-col gap-3 p-3 rounded-b-2xl">
          <div className="flex items-center justify-center gap-2">
            {newsCategory.map((category) => (
              <div
                onClick={() => setSelectedCategory(category.id)}
                key={category.id}
                className={`w-20 p-1 rounded-full text-center cursor-pointer ${selectedCategory === category.id ? "bg-[#2563EB1A] text-gray-800" : "bg-white text-gray-800 border border-gray-800"}`}
              >
                <p className="text-gray-800 text-[12px] font-bold ">
                  {category.name}
                </p>
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
}
