import Link from "next/link";
import React from "react";

const ArrowIcon = () => (
  <svg
    width="24"
    height="24"
    viewBox="0 0 24 24"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M15.0001 19.92L8.48009 13.4C7.71009 12.63 7.71009 11.37 8.48009 10.6L15.0001 4.07996"
      stroke="#58595D"
      strokeWidth="1.5"
      strokeMiterlimit="10"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
  </svg>
);

const assemblyListItem = [
  {
    title: "مجمع عمومی عادی سالیانه سال 1402",
    description:
      "اطلاعیه - شماره 1 لغو برگزاری مجمع عمومی عادی سالانه نوبت اول ( 1401/06/02 ) و نوبت دوم ( 1401/06/13 )آگهی منتشره جهت برگزاری مجمع عمومی عادی سالیانه سازمان نوبت اول در تاریخ 1401/06/02 و نوبت دوم در تاریخ 1401/06/13 به دلیل آماده نشدن بودجه سال 1401 و صورت‌های مالی عملکرد سال 1400 برگزار نمی‌گردد.و متعاقباً فراخوان شرکت در مجمع عمومی عادی سالیانه سال جاری صادر و به اطلاع خواهد رسید.",
  },
  {
    title:
      "اطلاعیه - شماره 2 مجمع عمومی عادی سالانه (نوبت اول) دستور جلسه به اطلاع اعضای محترم سازمان می‌رساند:",
    description:
      "مجمع عمومی فوق‌العاده (نوبت اول) سازمان با دستور جلسه زیر طبق آگهی منتشر در تاریخ 19 و 28 شهریور 1401 در روزنامه ایران، تشکیل می‌گردد.بدین‌وسیله از کلیه اعضاء محترم سازمان نظام مهندسی ساختمان استان تهران دعوت می‌نماید در جلسه مجمع عمومی عادی سالانه (نوبت اول) سازمان که در ساعت 13 روز شنبه مورخ 1401/06/19 در محل سازمان نظام مهندسی ساختمان استان تهران به آدرس شهرک غرب، خیابان مهستان، پلاک 10، طبقه 5، سالن کنفرانس برگزار می‌شود، با در دست داشتن کارت عضویت سازمان حضور به هم رسانید.دستور جلسه:1 - استقرار هیئت‌رئیسه موقت سنی و انتخاب هیئت‌رئیسه اصلی مجمع.2 - ارائه گزارش عملکرد سالیانه هیئت‌مدیره و اعلام نظر نسبت به آن.3 - ارائه گزارش صورت‌های مالی عملکرد سازمان نظام مهندسی ساختمان استان تهران منتهی به 1399/12/304 - ارائه گزارش بازرسان سازمان استان (عملکرد سال 1399)5 - بررسی و تصویب صورت‌های مالی عملکرد سازمان نظام مهندسی ساختمان استان تهران منتهی به 1399/12/306 - بررسی و تصویب بودجه پیشنهادی هیئت‌مدیره برای سال 1400الف-حقوق، مزایا، حق‌الزحمه، حق‌الجلسه و پاداش:الف-1-حقوق و مزایای ماهانه رئیس سازمان استان.الف-2-حق‌الزحمه خزانه‌دار سازمان استان.الف-3-حق‌الجلسه اعضای هیئت‌رئیسه به‌جز رئیس و خزانه‌دار سازمان استان.الف-4-حق‌الجلسه اعضای اصلی هیئت‌مدیره به‌جز رئیس و خزانه‌دار سازمان.الف-5-پاداش بازرس.الف-6-حق‌الجلسه اعضای شورای انتظامی سازمان استان.الف-7-اتخاذ تصمیم در خصوص منابع درآمد سازمان استان برای تأمین هزینه‌های آن.الف-8-تعیین و تصویب ورودیه و حق عضویت سالانه اعضای حقیقی و حقوقی.الف-9-تعیین و تصویب سایر منابع درآمد سازمان استان مطابق ماده 37 قانون و سایر مقررات لازم‌الاجرا.7 - ارائه گزارش صورت‌های مالی عملکرد سازمان نظام مهندسی ساختمان استان تهران منتهی به 1400/12/298 - ارائه گزارش بازرسان سازمان استان (عملکرد سال 1400)9 - بررسی و تصویب صورت‌های مالی عملکرد سازمان نظام مهندسی ساختمان استان تهران منتهی به 1400/12/2910 - بررسی و تصویب بودجه پیشنهادی هیئت‌مدیره برای سال 1401.الف-حقوق، مزایا، حق‌الزحمه، حق‌الجلسه و پاداش:الف-1-حقوق و مزایای ماهانه رئیس سازمان استان.الف-2-حق‌الزحمه خزانه‌دار سازمان استان.الف-3-حق‌الجلسه اعضای هیئت‌رئیسه به‌جز رئیس و خزانه‌دار سازمان استان.الف-4-حق‌الجلسه اعضای اصلی هیئت‌مدیره به‌جز رئیس و خزانه‌دار سازمان.الف-5-پاداش بازرس.الف-6-حق‌الجلسه اعضای شورای انتظامی سازمان استان.الف-7-اتخاذ تصمیم در خصوص منابع درآمد سازمان استان برای تأمین هزینه‌های آن.الف-8-تعیین و تصویب ورودیه و حق عضویت سالانه اعضای حقیقی و حقوقی.الف-9-تعیین و تصویب سایر منابع درآمد سازمان استان مطابق ماده 37 قانون و سایر مقررات لازم‌الاجرا.11- تعیین تعداد مجامع فوق‌العاده مطابق با بند ب و تبصره 1 اصلاحی و تبصره 2 ماده 5312- تعیین روزنامه کثیرالانتشار برای اطلاعیه‌های سازمان استان.در صورت عدم حصول اکثریت لازم، مجمع عمومی عادی سالانه (نوبت دوم) ساعت 16 روز دوشنبه مورخ 06/28/ 1401 به آدرس: تهران، بزرگراه شیخ فضل‌الله نوری جنوب، ابتدای بزرگراه تهران-کرج، ورودی غربی (اصلی) ورزشگاه آزادی، بعد از هتل المپیک، سالن همایش ایرانیان با همین دستور جلسه برگزار خواهد شد. هیئت‌مدیره سازمان نظام مهندسی ساختمان استان تهران",
  },
  {
    title:
      "اطلاعیه - شماره 3 مجمع عمومی عادی سالانه (نوبت اول) پرداخت حق عضویتبه اطلاع اعضای محترم سازمان می‌رساند؛",
    description:
      "جهت شرکت در مجمع عمومی عادی سالانه (نوبت اول) مورخ 19 شهریور 1401 و مجمع عمومی عادی سالانه (نوبت دوم) 28 شهریور 1401 پرداخت حق عضویت تا پایان سال  1400 ضروری است.اعضای محترم سازمان حداکثر تا  24 ساعت قبل از زمان برگزاری مجمع می‌توانند با مراجعه به سایت سازمان به‌صورت آنلاین حق عضویت خود را پرداخت نمایند.امکان پرداخت حق عضویت در محل برگزاری مجمع مطابق مفاد شیوه‌نامه نحوه تشکیل و اداره مجامع عمومی سازمان نظام مهندسی ساختمان استان میسر نیست.",
  },
];

export default function AssemblyDetailsPage() {
  return (
    <div className="p-3">
      <div className="flex items-center gap-4 mb-3">
        <p className="text-gray-400 text-sm">صفحه اصلی</p>
        <ArrowIcon />
        <Link href={"/introduction/assembly"} className="text-gray-600 text-sm">
          مجمع عمومی
        </Link>
      </div>
      <div className="flex flex-col gap-5">
        {assemblyListItem.map((item, index) => (
          <div
            key={index}
            className="bg-white rounded-xl flex flex-col gap-3 p-3"
          >
            <h2 className="text-sm text-gray-600">{item.title}</h2>
            <p className="text-[13px] font-bold text-gray-600 leading-7 text-start">
              {item.description}{" "}
            </p>
          </div>
        ))}
      </div>
    </div>
  );
}
